ROBOT_NAME = "V2ray Army"
BACK_MSG = "منو اصلی"
BACK_BTN_MSG = "🔙 بازگشت"
# Start cmd messages #######
JOIN_CHANNELS_MSG = """باسلام ,لطفا ابتدا داخل کانال های زیر عضو شوید.

/start"""
WELLCOME_MSG = f"به ربات {ROBOT_NAME} خوش اومدی🌹"

BUY_SERVICE_MSG = "🛍 خرید سرویس"
EXT_SERVICE_MSG = "⚡️ تمدید سرویس"
TEST_SERVICE_MSG = "📮 اکانت تست"
PRICE_LIST_MSG = "💰 تعرفه ها"
REFERRAL_MSG = "💎 زیرمجموعه گیری"
ACCOUNT_MSG = "👤 حساب کاربری"
MY_SERVICE_MSG = "📥 سرویس های من"
MULTI_BUY_MSG = "🤝 خرید عمده"
AMOOZESH_MSG = "ℹ️آموزش ربات"
CONTACTUS_MSG = "📫  پشتیبانی"
HELP_MSG = "💬  راهنما"
SEARCHING_SERVICES_MSG = "جستجوی سرویس"

START_KEYBOARD_MSG = [
    [BUY_SERVICE_MSG],
    [TEST_SERVICE_MSG, PRICE_LIST_MSG],
    [EXT_SERVICE_MSG, MULTI_BUY_MSG],
    [ACCOUNT_MSG, MY_SERVICE_MSG],
    [REFERRAL_MSG, CONTACTUS_MSG, AMOOZESH_MSG],
    [HELP_MSG]
]

BACK_KEYBOARD_MSG = [
    [BACK_BTN_MSG],
]
##########################


# Buy messages
BUY_SERVICE_WELCOME_MSG = "🔰 کشور‌ی که میخوای رو انتخاب کن:"
SERVICE_SELECT_MSG = "🕙 مدت زمان سرویست رو انتخاب کن:"
PERIOD_SELECT_MSG = "📥 حجم مدنظرت رو انتخاب کن:"
MULTI_COUNT_MSG = "لطفا سرویس را وارد کنید"
SERVICE_NOT_EXIST_MSG = "❌ متاسفانه سرویس مورد نظر شما درحال حاضر موجود نمی باشد"
TEST_SERVICE_EXIST_MSG = "❕ شما قبلا یکبار سرویس تست را برای این کشور دریافت کرده اید"
FACTOR_PAYING_MSG = """
فاکتور پرداخت شما:

🌐لوکیشن سرویس: {}
⌛️مدت سرویس: {} روزه
👤تعداد اتصال همزمان: {} کاربر
♻️حجم سرویس: {} گیگ
💲هزینه سرویس: {:,} تومان
"""

TEST_FACTOR_PAYING_MSG = """
اکانت تست شما :

🌐لوکیشن سرویس: {}
⌛️مدت سرویس: {} روزه
👤تعداد اتصال همزمان: {} کاربر
♻️حجم سرویس: {} مگابایت
"""

MULTI_FACTOR_PAYING_MSG = """
فاکتور پرداخت شما:

🌐لوکیشن سرویس: {}
⌛️مدت سرویس: {} روزه
👤تعداد اتصال همزمان: {} کاربر
♻️حجم سرویس: {} گیگ
💲هزینه سرویس: {:,} تومان

🎖 تعداد خرید شما از این سرویس: {} عدد
💳 مجموع هزینه پرداختی: {:,} تومان

"""

TEST_ACCOUNT_MSG = "اکانت تست"

PAY_WITH_WALLET_MSG = "💵 پرداخت از کیف پول"
GET_TEST_ACC_MSG = "✅ دریافت اکانت"
PAY_WITH_CART_MSG = "💰 افزایش موجودی"
DIRECT_PAY_MSG = "💳 پرداخت مستقیم"
DISCOUNT_BTN = "🎁 کد تخفیف دارم"

# Account messages
ACCOUNT_INFO_MSG = """
اطلاعات حساب کاربری شما به شرح زیر می باشد:

▫️ آیدی عددی شما: {}
👥 تعداد زیرمجموعه‌ها: {}
🌐 تعداد سرویس‌ها: {}
✅ پرداخت‌های موفق: {}
❌ فاکتورهای پرداخت نشده: {}
💵 موجودی کیف پول شما: {:,} تومان
"""
DEPOSIT_MSG = "💰 افزایش موجودی"

# My services
NOT_HAVE_ANY_SERVICE_MSG = "❌ شما در حال حاضر هیچ سرویس فعالی ندارید "
HAVE_ANY_SERVICE_MSG = "لطفا سرویس مدنظرتون را انتخاب نمایید"

# Help
ANDROID_MSG = "اندروید"
ANDROID_TEXT = """
🌟 آموزش اجرای کانفیگ برای اندروید

1. نرم افزار v2rayNG را نصب کنید.

2. آدرس سرور را کپی کنید.

3. روی صفحه اصلی اپلیکیشن گزینه (+) را انتخاب کنید. سپس گزینه import from clipboard را بزنید.

4. دکمه دایره پایین صفحه را بزنید و به سرور جدید ساخته شده متصل شوید.

 🔰آموزش تصویری اتصال،تنظیمات مخصوص و فایل دانلود برنامه را در لینک زیر دریافت کنید:
https://t.me/+Z-8Af-V8ZJ5mYWQ0
"""
IOS_MSG = "آی او اس"
IOS_TEXT = """
🌟آموزش اجرای کانفیگ برای ios

1. برنامه  FairVPN یا Wings x را از اپل‌استور دانلود کنید.

2. آدرس سرور را کپی کنید.

3. روی اپلیکیشن به قسمت server بروید و از گوشه بالا سمت راست گزینه (+) را بزنید.  گزینه server links را انتخاب کنید و آدرس سرور را که کپی کرده بودید،  paste کنید و گزینه save را بزنید. 

4-دکمه‌ی دایره‌ی  اپلیکیشن را بزنید تا اتصال برقرار شود

🔰آموزش تصویری اتصال،تنظیمات مخصوص و فایل دانلود برنامه را در لینک زیر دریافت کنید:
https://t.me/+XkdohS6LVYxkMmE0
"""
WINDOWS_MSG = "ویندوز"
WINDOWS_TEXT = """
🌟تنظیمات مخصوص  و آموزش تصویری اتصال با برنامه‌های Nekoray و v2rayN را در لینک زیر مشاهده کنید:

https://t.me/amoozeshetesalwindowsarmy
"""
MAC_MSG = "مک"
MAC_TEXT = """
🌟آموزش تصویری اتصال با برنامه‌ Fair vpn در لینک زیر مشاهده کنید:

https://t.me/amoozeshetesaldarmacarmy
"""
LINUX_MSG = "لینوکس"
LINUX_TEXT = """
یک پیام من چیزی نمدونستم
"""
FAQ_MSG = "سوالات متداول"
FAQ_TEXT = """
❔سرویس‌های شما روی چه اپراتور و سیستم‌عاملی کار میکنند؟
✅ سرویس‌های ما روی تمام خطوط همراه و اوپراتورهای ارائه دهنده سرویس اینترنت متصل میشوند و بر روی تمام سیستم‌عامل ها کار میکنند. در صورت عدم اتصال و رفع مشکل شما، هزینه پرداختی عودت داده خواهد شد.

❔آیا سرویس‌های شما ip ثابت هستند؟
✅ بله. تمام سرویس‌های ارائه شده ما دارای ip ثابت هستند.

❔کدام کشور را برای خرید انتخاب کنم؟
✅ این مورد بستگی به نوع استفاده شما دارد. برای استفاده روزمره پیشنهاد ما کشورهای آلمان/ هلند هستند که بالاترین سرعت را دارند.
اگر تریدر هستید پیشنهاد ما کشور امارات است که بالاترین پایداری را دارد.
اگر گیمر هستید پیشنهاد ما کشور ترکیه است که  پینگ پایین و سرعت بالایی دارد.

❔اگر سرویس من دچار کندی یا قطعی شود چه کاری انجام دهم؟
✅ ابتدا از بخش راهنما، نوع سیستم عامل خود را انتخاب کنید تا تنظیمات مخصوص آن را اعمال کنید و به بهترین عملکرد سرویس برسید. اگر همچنان مشکل شما برطرف نشد بعد از بررسی میزان حجم سرویس و زمان انقضا، از بخش "گزارش خرابی" در بخش "سرویس‌های من" برای ادمین فنی تیکت ارسال کنید.

❔ چطور میتوانم حجم باقی‌مانده و زمان انقضای سرویس خود را مشاهده کنم؟
✅ میتوانید با رفتن به بخش "سرویس‌های من" سرویس خود را انتخاب کرده و از طریق گزینه "اطلاعات سرویس" اطلاعات لحظه‌ای مربوط به سرویستان را مشاهده کنید.

❔آیا میتوانم سرویس خودم را تمدید کنم؟
✅ بله با انتخاب گزینه "تمدید سرویس" در بخش سرویس‌های من میتوانید سرویس خود را با دریافت تخفیف، تمدید کنید.

❔شرایط همکاری با شما به چه صورتی است؟
✅ شما میتوانید با انتخاب بخش "خرید عمده" و خرید حداقل 10 سرویس از تخفیف‌های ویژه بر روی قیمت سرویس‌ها بهره‌مند شوید.

❗️در صورتی که پاسخ خود را در میان سوالات نگرفتید، میتوانید از بخش "ارتباط با ما" سوال خود را مطرح کنید.
"""
HELP_START_MSG = """
🔰برای دریافت راهنمای اتصال لطفا سیستم عامل خود را انتخاب کنید
🔹همچنین قبل از ارسال پیام به پشتیبانی حتما بخش سوالات متداول را مطالعه کنید
"""

AMOOZESH_MSG_TEXT = """آموزش ربات ...."""

# Order MSG
ORDER_SUCCESS_MSG = """
پرداخت شما با موفقیت انجام شد ✅
تا لحظاتی دیگر سرویس برای شما ارسال خواهد شد
سپاس از همراهی شما🌹
"""
ORDER_SUCCESS_DETAILS_MSG = """
سرویس شما ارسال شد ✅
🔹لطفا برای راهنمایی نصب بر روی سیستم‌ عامل‌های مختلف به بخش "راهنما" در ربات مراجعه کنید
"""

ORDER_TEST_SUCCESS_MSG = """
سرویس تست شما با موفقیت ایجاد گردید ✅
تا لحظاتی دیگر سرویس برای شما ارسال خواهد شد
سپاس از همراهی شما🌹
"""
ORDER_TEST_CANCELED_MSG = """
 به دلیل عدم داشتن ظرفیت سرور، سرویس تست شما کنسل گردید. 
"""

ORDER_UNDER_PAY_MSG = """
⭕ پرداخت وجه شما کمتر از مبلغ سفارش می باشد، 
مبلغ واریز شده، به عنوان موجودی به کیف پول شما اضافه گردید.
"""

ORDER_DETAILS_MSG = """
🔰پلن انتخابی: {}
🌐لوکیشن: {}
👤تعداد کاربر: {}
♻️حجم: {}
🔸حجم مصرف شده: {}
🔹حجم باقی مانده: {}
⏱زمان خرید: {}
⏳زمان انقضا : {}
💠وضعیت: {}
💲قیمت سرویس: {}
"""

ORDER_CONFIG_MSG = """
کانفیگ سفارش شماره {} شما: 
<code>{}</code>
"""

ORDER_CANCELED_MSG = """
❗️ متاسفانه سفارش شما به دلیل عدم داشتن ظرفیت سرور کنسل گردید. 
مبلغ سفارش به کیف پول شما بازگشت داده شد.
"""

INCOME_REFERRAL_MSG = """
تبریک 😍، مبلغ {:,} تومان از طریق زیرمجموعه شما برایتان واریز گردید.
"""

ORDER_EXTENSION_FACTOR_PAYING_MSG = """
فاکتور پرداخت شما:

🌐لوکیشن سرویس: {}
⌛️مدت سرویس: {} روزه
👤تعداد اتصال همزمان: {} کاربر
♻️حجم سرویس: {} گیگ
💲هزینه سرویس (تخفیف {}%): {:,} تومان

"""

ORDER_EXTENSION_IP_FACTOR_PAYING_MSG = """
فاکتور پرداخت شما:

🌐لوکیشن سرویس: {}
⌛️مدت سرویس: {} روزه
👤تعداد اتصال همزمان: {} کاربر
♻️حجم سرویس: {} گیگ
💲هزینه سرویس (هزینه تمدید {}%+): {:,} تومان

"""

ORDER_EXTENSION_NO_MSG = "❕ سرویس شما در حال حاضر قابل تمدید نمی باشد."
ORDER_TEST_EXTENSION_NO_MSG = "⚠️ اکانت تست غیرقابل تمدید می باشد."
ORDER_EXTENSION_ERROR_MSG = "سرویس شما غیرفعال می باشد، لطفا سرویس خود را تمدید نمایید."
ORDER_EXTENSION_BTN_MSG = "تمدید سرویس"
ORDER_EXTENSION_IP_BTN_MSG = "تمدید آی پی"
ORDER_LINK_BTN_MSG = "دریافت لینک"

ORDER_NOT_EXIST_MSG = "❗️ سفارش مورد نظر یافت نگردید."

NOT_ENOUGH_BALANCE_MSG = '⚠️ موجودی کیف پول شما برای پرداخت این فاکتور کافی نمی باشد.'
ERROR_IN_REGISTER_MSG = 'لطفا مجددا /start را بزنید.'

NEXT_MSG = "✅ ادامه"

DEPOSIT_AMOUNT_MSG = """
💳 لطفا میزان مبلغی که قصد داری کیف پولت رو شارژ کنی وارد کن ( عدد به تومان است)
♦️ حداقل میزان شارژ کیف پول {:,} تومان و حداکثر {:,} تومان است
"""
DEPOSIT_CARD_MSG = "💳 کارت به کارت"
DEPOSIT_CRYPTO_MSG = "💲 پرداخت رمز ارز"
DEPOSIT_CRYPTO_NEXT_MSG = "✅ تایید پرداخت"
ORDER_QRCODE_MSG = "کیو آر کد"
DEPOSIT_CRYPTO_FACTOR_MSG = """
برای پرداخت توسط رمز ارز مبلغ <b>{}</b> ترون به آدرس زیر واریز نمایید
<pre><code class="language-python">{}</code></pre>
♦️ پس از واریز ارز کد تراکنش خود را به ربات ارسال نمایید.
"""

DEPOSIT_CARD_FACTOR_MSG = """
برای پرداخت توسط کارت به کارت مبلغ <b>{}</b> تومان را به کارت زیر  واریز نمایید:
<pre><code class="language-python">{}</code></pre>

لطفا مبلغ را دقیق واریز نمایید و از نوشتن عبارات فیلترشکن، vpn و ... در توضیحات واریز خودداری فرمایید
"""
DEPOSIT_CARD_HELP_MSG = """
♦️ پس از واریز مانند نمونه زیر زمان واریز را برای ربات ارسال نمایید.
توجه نمایید لطفا زمان واریز را مطابق با زمان ثبت شده در فیش واریز وارد نمایید.

🔵 برای مثال اگر 100 هزارتومان واریز کرده‌اید و ساعت واریز در فیش شما 09:10 صبح است، مطابق فرمت زیر به ربات ارسال نمایید (زمان به ساعت و دقیقه) 👇🏻

09:10
"""

DEPOSIT_CRYPTO_CONFIRMED_MSG = "🎉 موجودی حساب شما با موفقیت افزایش یافت."
DEPOSIT_CRYPTO_ACCEPT_FACTOR_MSG = """
        ✅ تراکنش شما با موفقیت دریافت گردید،
💰 مبلغ واریزی : <b>{}</b> ترون
💰 آدرس واریزی : <b>{}</b>
در صورت درست بودن اطلاعات، دکمه <b>تایید پرداخت</b> را بزنید.
"""
DEPOSIT_CARD_ACCEPT_FACTOR_MSG = """
        ✅ تراکنش شما با موفقیت دریافت گردید،
💰 مبلغ واریزی : <b>{:,}</b> تومان
💰 شماره مرجع : <b>{}</b>
"""
INVALID_TX_ID_MSG = """
⭕ شماره کارت/تراکنش واریزی اشتباه می باشد.
"""
WAITING_TX_VALIDATION_MSG = """
🟠 تراکنش شما با مبلغ  </b>{}<b> ترون در حال پردازش می باشد،
خواهشا 5 دقیقه اقدام با ارسال مجدد نمایید.
"""
TX_ID_EXISTS_MSG = "🔵 چنین کد تراکنشی از قبل در سیستم ثبت گردیده است."
NO_TRS_CARD_MSG = "🔵  شماره هنوز مبلغی واریز نکرده اید یا تراکنش شما از قبل ثبت گردیده است، لطفا 5 دقیقه دیگر تلاش نمایید و مجددا مراحل خرید را طی کنید"
BAD_DATA_CARD_MSG = """
⭕️ لطفا زمان تراکنش را با اعداد انگلیسی و بصورت فرمت 24 ساعته ارسال کنید ( زمان ساعت و دقیقه)
🔰 نمونه:
22:15
08:05
"""

DEPOSIT_BAN_ALARM_MSG = """
❌ تعداد تلاش ناموفق شما بیشتر از 2 مورد شده است، در صورت تکرار اشتباه حساب کاربری شما به مدت 24 ساعت امکان واریز نخواهد داشت.
"""
DEPOSIT_BANED_MSG = """
❌ حساب کاربری شما به دلیل تلاش بیش از 3 بار جهت واریز کارت به کارت به مدت 24 ساعت معلق گردید.
"""
PRICE_SERVICE_LIST_MSG = """
📜 لیست تعرفه های سرویس های فعال ما :
"""
PRICE_SERVICE_OBJ_MSG = "لیست تمامی سرویس های فعال"

REFERRAL_BODY_MSG = """
وضعیت زیر مجموعه های شما 🏆
👥 تعداد زیرمجموعه : {} نفر
💳 کسب درآمد از زیر مجموعه : {:,} تومان
💠 کد دعوت شما : {}
لینک دعوت من  : 
{}
"""

REFERRAL_LINK_MSG = "📥 لینک دعوت من"
REFERRAL_BANNER_MSG = "🔖 بنر دعوت من"

REFERRAL_BANNER_TEXT_MSG = """
هم اکنون دوستان خود را دعوت کنید و از درآمد مجموعه سهیم باشید.
<b>{}%</b> مبلغ هر سفارش را دریافت نمایید.
لینک دعوت شما :
<a href="{}">لینک ورود شما</a>
"""
REFERRAL_USER_REGISTER_MSG = "🌟 کاربر جدیدی با لینک دعوت شما عضو گردید."

PRICE_LIST_ITEM_MSG = "{}، {} گیگ، {}|{:,} هزار تومان"

EXTENSION_ENTER_MSG = "لیست کانفیگ های قابل تمدید شما 🔰:"
EXTENSION_NOT_MSG = "⭕ درحال حاضر هیچ یک از سرویس های شما شرایط تمدید را ندارد."

TICKET_WELLCOME_MSG = "موضوع درخواست خود را انتخاب نمایید :"
TICKET_TECHNICAL_BTN = "🆘 تیکت فنی"
TICKET_FINANCIAL_BTN = "💵 تیکت مالی"
TICKET_OTHER_BTN = "🤝 ارسال نظر و ارتباط با ما"

TICKET_SUBJECT_TECHNICAL_CHOICES_MSG = """
👤 درخواست پیشتیبانی
موضوع درخواست شما :
{}
سرویس مورد نظر شما :
{}
"""
TICKET_SUBJECT_CHOICES_MSG = """
👤 درخواست پیشتیبانی
موضوع درخواست شما :
{}
"""

TICKET_SERVICE_MSG = "لطفا سرویس مورد نظر خود را انتخاب نمایید"
TICKET_LIMIT_MSG = "درحال حاضر شما بیش از {} درخواست پشتیبانی باز دارید."
TICKET_ORDER_LIMIT_MSG = "شما بر روی این سرویس تیکت باز دارید. لطفا برای ارتباط با پشتیبانی فنی بر روی پیام ارسال شده پشتیبانی ریپلای بزنید."
TICKET_ENTER_REQUEST_MSG = """
لطفا متن درخواست خود را در قالب یک پیام و بصورت کامل ارسال نمایید
"""

TICKET_ANSWER_REQUEST_MSG = """
لطفا متن جواب خود را در قالب یک پیام ارسال نمایید
"""
TICKET_ACCEPTED_MSG = "✅ درخواست شما با موفقیت ثبت گردید."
TICKET_LIMIT_TEXT_MSG = "♦️ متن در خواست شما باید بیش از 10 کارکتر باشد."

DEPOSIT_CRYPTO_HELP_MSG = """
کد تراکنش پرداخت مانند کد زیر می باشد : 
daba935667f3eddddd4e92effdf6a547e9adf7b173e788bcc56a65e8d65d8621
"""

ORDER_VALUE_ALARM_MSG = """
♦️ هشدار
سرویس : {}
"""

DEPOSIT_CARD_W_MSG = """
⌛ درحال بررسی تراکنش ...
اطلاعات شما با موفقیت دریافت گردید، لطفا چند لحظه صبر کنید تا روند تایید پرداخت شما انجام گردد.
"""

DISCOUNT_MSG = "💫 لطفا کد تخفیف خود را وارد نمایید"
DISCOUNT_ERROR_MSG = "❌ کد تخفیف منقضی یا اشتباه می باشد."
DISCOUNT_SUCCESS_MSG = """
✳️ کد تخفیف شما با موفقیت اعمال گردید.
درصد تخفیف : {}%

جهت ادامه فرآیند خرید، روی گزینه «ادامه» کلیک نمایید.
"""

EMERGENCY_MSG = """
کانفیگ اضطراری سرور <b>{}</b> 🤝
🗳️ حجم  : <b>{}</b> گیگ
♻️ مدت : <b>{}</b>  روز

مشخصات کانفیگ : 
<code>{}</code>

❤️ ممنون از صبر و شکیباییتان
"""

ADD_BALANCE_ORDER = """
میزان پرداخت شما بیشتر از مبلغ فاکتور بوده است.
معادل ریالی <b>{}</b> تومان به کیف پول شما اضافه شد ✅
"""
TICKET_MSG = """
✅ پاسخ تیکت شماره <b>{}</b>
🗳️ پیام پشتیبان »
 <b>{}</b>

⭕ درصورت نیاز به ارسال پیام، همین پیام را ریپلای نمایید
"""
TICKET_REPLAY_ERROR_MSG = "⭕ لطفا متن درستی را برای ارسال پاسخ به پشتیبانی ریپلای نمایید."
TICKET_CLOSED_MSG = """
تیکت شماره <b>{}</b> شما پس از پاسخ توسط پشتیبان بسته شد ✅
در صورت نیاز مجدد به ارتباط با پشتیبان‌های ما میتوانید از قسمت پشتیبانی تیکت جدیدی ثبت کنید
از همراهی شما سپاس‌گزاریم 🌹
"""
TICKET_ALERT_MSG = """تیکت جدید توسط <b>{}</b> ایجاد شد."""

DEPOSIT_LIMIT_MSG = "متاسفانه در بازه زمان {} تا {} واریز کارت به کارت غیرفعال می باشد."
DEPOSIT_CARD_BAN_MSG = "از آخرین درخواست شما {} دقیقه نگذشته است، لطفا بعد {} دقیقه اقدام به واریز کارت به کارت نمایید."
DEPOSIT_BAN_MSG = "حساب کاربری شما به دلیل تلاش بیشتر از حد به مدت 24 ساعت امکان واریز تومان ندارد."